org/core.org
#+title: Naviserver on ubuntu image
* Auxiliary Information                                            :noexport:
:PROPERTIES:
:CUSTOM_ID: auxiliary-information
:END:
The setupfile contain global common property configuration:
#+SETUPFILE: .configuration/global_vars_org.setup
#+SETUPFILE: .configuration/global_property_org.setup
#+SETUPFILE: .configuration/global_vars_html.setup
#+EXPORT_FILE_NAME: ../Readme
#+OPTIONS: auto-id:t

* About
:PROPERTIES:
:CUSTOM_ID: about
:END:
This is [[https://wiki.tcl-lang.org/page/NaviServer][NaviServer]] on [[https://hub.docker.com/_/ubuntu][ubuntu base docker image]] (version 20.04).  To install the NaviServer I used code from  [[https://github.com/gustafn/install-ns][Gustaf Neumann]] script [[https://github.com/gustafn/install-ns/blob/master/install-oacs.sh][install-ns.sh]].   The base image is [[https://hub.docker.com/_/ubuntu][ubuntu]].

Naviserver is self-hosting at https://chiselapp.com/user/oupfiz5/repository/naviserver.

If you are reading this on GitHub, then you are looking at a Git mirror of the self-hosting Naviserver repository.  The purpose of that mirror is to test and exercise Fossil's ability to export a Git mirror and using Github CI/CD  (Github Actions). Nobody much uses the GitHub mirror, except to verify that the mirror logic works. If you want to know more about Naviserver, visit the official self-hosting site linked above.

* Table of Contents :TOC_3:noexport:
:PROPERTIES:
:CUSTOM_ID: table-of-contents
:END:
- [[#about][About]]
- [[#prerequisite][Prerequisite]]
  - [[#tools][Tools]]
  - [[#third-party-tools][Third party tools]]
- [[#installation][Installation]]
  - [[#download-from-dockerhub][Download from dockerhub]]
  - [[#build-from-chiselapp-fossil][Build from chiselapp (fossil)]]
  - [[#build-from-github][Build from github]]
  - [[#configuration][Configuration]]
    - [[#build-arguments][Build arguments]]
    - [[#example-of-build][Example of build]]
- [[#configuration-options][Configuration options]]
  - [[#general-options][General options]]
  - [[#timezone][Timezone]]
  - [[#http-listen-port][HTTP listen port]]
  - [[#configuration-file][Configuration file]]
- [[#quickstart][Quickstart]]
- [[#continues-integration][Continues integration]]
- [[#troubleshooting][Troubleshooting]]
  - [[#log-output][Log output]]
  - [[#shell-access][Shell access]]

* Prerequisite
:PROPERTIES:
:CUSTOM_ID: prerequisite
:END:
** Tools
:PROPERTIES:
:CUSTOM_ID: tools
:END:
1. *nix operation system
2. Install Docker
3. Install git (optional)
4. Install fossil (optional)
** Third party tools
:PROPERTIES:
:CUSTOM_ID: third-party-tools
:END:
They are using for testing and scanning:
1. [[https://github.com/bats-core][Bats]]
2. [[https://www.shellcheck.net/][Shellcheck]]
3. [[https://github.com/hadolint/hadolint][Hadolynt]]
4. [[https://github.com/goodwithtech/dockle][Dockle]]
5. Snyk - not necessarily
6. Trivy - not necessarily
* Installation
:PROPERTIES:
:CUSTOM_ID: installation
:END:
** Download from dockerhub
:PROPERTIES:
:CUSTOM_ID: download-from-dockerhub
:END:
#+begin_src sh :tangle no :noweb yes
   docker pull oupfiz5/naviserver:4.99.23
#+end_src

** Build from chiselapp (fossil)
:PROPERTIES:
:CUSTOM_ID: build-from-chiselapp--fossil-
:END:
#+begin_src sh :tangle no :noweb yes
fossil clone https://chiselapp.com/user/oupfiz5/repository/naviserver    naviserver.fossil
mkdir naviserver
cd naviserver
fossil open ../naviserver.fossil
#+END_SRC

Build image using multi steps  (by means of docker from [[https://hub.docker.com/repository/docker/oupfiz5/tcl-build][oupfiz5/tcl-build]]):
#+begin_src sh :tangle no :noweb yes
docker build -t oupfiz5/naviserver:4.99.23 -f ./Dockerfile .
#+end_src

** Build from github
:PROPERTIES:
:CUSTOM_ID: build-from-github
:END:
 #+begin_src sh :tangle no :noweb yes
 git clone https://github.com/oupfiz5/naviserver.git
 cd naviserver
 docker build -t oupfiz5/naviserver .
 #+end_src


Build image using multi steps  (by means of docker from [[https://hub.docker.com/repository/docker/oupfiz5/tcl-build][oupfiz5/tcl-build]]):
#+begin_src sh :tangle no :noweb yes
docker build -t oupfiz5/naviserver:4.99.23 -f ./Dockerfile .
#+end_src

** Configuration
:PROPERTIES:
:CUSTOM_ID: configuration
:END:
*** Build arguments
:PROPERTIES:
:CUSTOM_ID: build-arguments
:END:
 |-------------------+---------+----------------------------------------|
 | Arguments         | Default | Description                            |
 |-------------------+---------+----------------------------------------|
 | BUILD_DATE        |    none | Set build date for label               |
 |-------------------+---------+----------------------------------------|
 | NS_VERSION        | 4.99.23 | Define version for Naviserver          |
 |-------------------+---------+----------------------------------------|
 | NS_MODULE_VERSION | 4.99.23 | Define version for Naviserver  modules |
 |-------------------+---------+----------------------------------------|
 | TCL_VERSION       |  8.6.11 | Define version for  tcl                |
 |-------------------+---------+----------------------------------------|
 | TCLLIB_VERSION    |  1.1.20 | Define version for  tcllib             |
 |-------------------+---------+----------------------------------------|
 | TDOM_VERSION      |   0.9.1 | Define version for tdom                |
 |-------------------+---------+----------------------------------------|
 | RL_JSON_VERSION=  |  0.11.1 | Define version for rl_json             |
 |-------------------+---------+----------------------------------------|
 | XOTCL_VERSION     |   2.3.0 | Define version for xotcl               |
 |-------------------+---------+----------------------------------------|
*** Example of build
:PROPERTIES:
:CUSTOM_ID: example-of-build
:END:
#+begin_src sh :tangle no :noweb yes
 docker build --no-cache \
         --build-arg BUILD_DATE=$(date -u +"%Y-%m-%dT%H:%M:%SZ") \
         --build-arg NS_VERSION='4.99.23' \
         --build-arg TCL_VERSION='8.6.11' \
         -t oupfiz5/naviserver:4.99.23 \
         -f ../Dockerfile \
          ../.
#+END_SRC
* Configuration options
:PROPERTIES:
:CUSTOM_ID: configuration-options
:END:
** General options
:PROPERTIES:
:CUSTOM_ID: general-options
:END:
 |--------------------+----------------+-------------------------------------|
 | Option             | Default        | Description                         |
 |--------------------+----------------+-------------------------------------|
 | TZ                 | UTC            | Set timezone, example Europe/Moscow |
 |--------------------+----------------+-------------------------------------|
 | HTTP               | 8090           | Set http listen port, example 18090 |
 |--------------------+----------------+-------------------------------------|
 | [[Configuration file][Configuration file]] | nsd-config.tcl | Configuration file for Naviserver   |
 |--------------------+----------------+-------------------------------------|

** Timezone
:PROPERTIES:
:CUSTOM_ID: timezone
:END:
Set the timezone for the container, defaults to UTC. To set the timezone set the desired timezone with the variable TZ.
#+begin_src sh :tangle no :noweb yes
docker run -itd \
       --restart always \
       --name=naviserver \
       --env 'TZ=Europe/Moscow' \
       -p 127.0.0.1:8090:8080 \
       oupfiz5/naviserver:4.99.23
#+END_SRC

** HTTP listen port
:PROPERTIES:
:CUSTOM_ID: http-listen-port
:END:

Set the http listen port for the container =-p 127.0.0.1:18090:8080=.  In this case the Naviserver is accessible by URL [[http://localhost:8090][http://localhost:18090]].
#+begin_src sh :tangle no :noweb yes
docker run -itd \
       --restart always \
       --name=naviserver \
       -p 127.0.0.1:18090:8080 \
       oupfiz5/naviserver:4.99.23
#+END_SRC
