org/core.org
** Configuration file
:PROPERTIES:
:CUSTOM_ID: configuration-file
:END:
The default configuration file is =rootfs/usr/local/ns/conf/nsd-config.tcl=.  For using own configuration file you can apply docker mount option:
1. Create own configuration file with name =nsd-config.tcl=
2. Put it to some directory (for example =rootfs/usr/local/ns/conf/test=)
3. Mount the the directory from item 2 as =/usr/local/ns/conf=
  #+begin_src sh :tangle no :noweb yes
docker run -itd \
       --restart always \
       --name=naviserver  \
       -p 127.0.0.1:8090:8080 \
       --mount type=bind,src=$(pwd)/rootfs/usr/local/ns/conf/test,destination=/usr/local/ns/conf \
       oupfiz5/naviserver:4.99.23
  #+END_SRC

* Quickstart
:PROPERTIES:
:CUSTOM_ID: quickstart
:END:
Start Naviserver using CLI:
#+BEGIN_SRC sh :tangle no
docker run -itd \
       --restart always \
       --name=naviserver \
       -p 127.0.0.1:8090:8080 \
       oupfiz5/naviserver:4.99.23
#+END_SRC

Start Naviserver using script =start.sh=:
#+begin_src sh :tangle no :noweb yes :dir ../src/
./start.sh
#+END_SRC
After start open the naviserver will be accessible by url =http://localhost:8090=
* Continues integration
:PROPERTIES:
:CUSTOM_ID: continues-integration
:END:
For  build and push docker images using  [[https://github.com/oupfiz5/naviserver/blob/master/.github/workflows/on-push.yaml][Github Actions workflow]]. Flow process is [[https://guides.github.com/introduction/flow/][GitHub flow]].
* Troubleshooting
:PROPERTIES:
:CUSTOM_ID: troubleshooting
:END:
** Log output
:PROPERTIES:
:CUSTOM_ID: log-output
:END:
For debugging and maintenance purposes you may want access the output log. If you are using Docker version 1.3.0 or higher you can access a running containers shell by starting bash using docker interactive:

#+begin_src sh :tangle no :noweb yes
docker run -it --rm \
       --name=naviserver \
       -p 127.0.0.1:8090:8080 \
       oupfiz5/naviserver:latest
#+END_SRC

** Shell access
:PROPERTIES:
:CUSTOM_ID: shell-access
:END:
For debugging and maintenance purposes you may want access the containers shell. If you are using Docker version 1.3.0 or higher you can access a running containers shell by starting bash using docker exec:
#+begin_src sh :tangle no :noweb yes
docker exec -it naviserver /bin/bash
#+END_SRC

* Code :code:noexport:
:PROPERTIES:
:CUSTOM_ID: code
:END:
** VERSIONS :code:
:PROPERTIES:
:CUSTOM_ID: versions
:END:
#+begin_src sh :shebang ""
  # * Version
  NS_VERSION="${NS_VERSION:-4.99.23}"
  NS_MODULES_VERSION="${NS_MODULES_VERSION:-4.99.23}"
  RL_JSON_VERSION="${RL_JSON_VERSION:-0.11.1}"
  TDOM_VERSION="${TDOM_VERSION:-0.9.1}"
  THREAD_VERSION="${THREAD_VERSION:-2.8.6}"
  TCL_VERSION="${TCL_VERSION:-8.6.11}"
  TCLLIB_VERSION="${TCLLIB_VERSION:-1.20}"
  XOTCL_VERSION="${XOTCL_VERSION:-2.3.0}"

  CONTAINER_NAME="${CONTAINER_NAME:-naviserver}"
  NS_IMAGE_TAG="${NS_IMAGE_TAG:-4.99.23}"
  IMAGE_NAME="${IMAGE_NAME:-naviserver}"
  IMAGE_REPOSITORY="${IMAGE_REPOSITORY:-oupfiz5}"
  IMAGE_TAG="${IMAGE_TAG:-${NS_IMAGE_TAG}}"
  TCL_BUILD_IMAGE_REPOSITORY="${TCL_BUILD_IMAGE_REPOSITORY:-oupfiz5}"
  TCL_BUILD_IMAGE_NAME="${TCL_BUILD_IMAGE_NAME:-tcl-build}"
  TCL_BUILD_IMAGE_TAG="${TCL_BUILD_IMAGE_TAG:-22.01}"
  UBUNTU_IMAGE_REPOSITORY=""
  UBUNTU_IMAGE_NAME="${UBUNTU_IMAGE_NAME:-ubuntu}"
  UBUNTU_IMAGE_TAG="${UBUNTU_IMAGE_TAG:-20.04}"
#+end_src
** ../.fossil-settings/crlf-glob
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-crlf-glob
:END:
#+begin_src sh :shebang ""
  *
#+end_src
** ../.fossil-settings/crlf-glob.no-warn
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-crlf-glob-no-warn
:END:
#+begin_src sh :shebang ""
  *
#+end_src
** ../.fossil-settings/ignore-glob
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-ignore-glob
:END:
#+begin_src sh :shebang ""
  .git/
  .github-mirroring/*
  docs/
  org/.configuration/*
  tests/.bats-battery/*/.git
  tests/.bats-battery/*/.github
#+end_src
** ../.fossil-settings/crlf-glob
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-crlf-glob
:END:
#+begin_src sh :shebang ""
  *
#+end_src
** ../.github/workflows/on-push.yaml :code:
:PROPERTIES:
:CUSTOM_ID: ----github-workflows-on-push-yaml
:END:
#+begin_src yaml :shebang ""
  name: Build and push docker images

  on:
    push:
      branches:
        - master
        - main
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile*'
        - 'src/rootfs/**'
        - 'src/hook/*'
        - 'src/*.sh'
        - 'src/VERSIONS'
        - 'tests/**'
    pull_request:
      branches:
        - master
        - main
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile'
        - 'src/rootfs/**'
        - 'src/hook/*'
        - 'src/*.sh'
        - 'tests/**'
        - 'src/VERSIONS'
  jobs:
    build:
      name: Build and push image to dockerhub
      runs-on: ubuntu-latest
      steps:
        - name: Repo checkout
          uses: actions/checkout@v2

        - name: Login to DockerHub Registry
          run: |
            echo  ${{ secrets.DOCKERHUB_TOKEN }} | docker login --username ${{ secrets.DOCKERHUB_USERNAME }} --password-stdin

        - name: Naviserver. Build and push image.
          run: |
            echo "::group::Prepare environment"
            set -a; source ${GITHUB_WORKSPACE}/src/VERSIONS ; set +a;
            cd ${GITHUB_WORKSPACE}/src/hook
            echo "::endgroup::"
            echo "::group::Build image"
            ./build.sh
            echo "::endgroup::"
            echo "::group::Push image"
            ./push.sh
            echo "::endgroup::"
#+end_src
** ../.github/workflows/test.yaml :code:
:PROPERTIES:
:CUSTOM_ID: ----github-workflows-test-yaml
:END:
#+begin_src yaml :shebang ""
  name: Tests

  # * Controls
  # Controls when the action will run.
  on:
    push:
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile*'
        - 'src/rootfs/**'
        - 'src/hook/*'
        - 'src/*.sh'
        - 'tests/**'
        - 'src/VERSIONS'
      branches-ignore:
        - 'master'
        - 'main'
    pull_request:
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile'
        - 'src/rootfs/**'
        - 'src/hook/*'
        - 'src/*.sh'
        - 'tests/**'
        - 'src/VERSIONS'
      branches-ignore:
        - 'master'
        - 'main'
    workflow_dispatch:

  # * Environments
  env:
    IMAGE_TAG: "${{ github.sha }}"

  # * Jobs
  jobs:
    checks:
      name: Tests and Checks
      runs-on: ubuntu-20.04
      steps:
        - name: Repo checkout
          uses: actions/checkout@v2

        - name: Check shell files (shellcheck)
          run: |
            sudo apt-get update -y
            sudo apt-get install shellcheck
            cd ${GITHUB_WORKSPACE}/tests
            .bats-battery/bats-core/bin/bats 01.shellchecks.bats

        - name: Check Dockerfile (hadolint)
          run: |
            cd ${GITHUB_WORKSPACE}/tests
            .bats-battery/bats-core/bin/bats 02.dockerfile_check.bats

        - name: Naviserver. Build. Check image and container.
          run: |
            echo "::group::Build image"
            echo "Build image"
            set -a; source ${GITHUB_WORKSPACE}/src/VERSIONS ; set +a;
            export IMAGE_TAG="${{ github.sha }}"
            cd ${GITHUB_WORKSPACE}/src/hook
            ./build.sh
            echo "::endgroup::"

            echo "::group::Check image and container"
            cd ${GITHUB_WORKSPACE}/tests
            echo "Check docker image (dockle)"
            .bats-battery/bats-core/bin/bats 03.docker_image_check.bats
            echo "Check docker container"
            .bats-battery/bats-core/bin/bats 04.container_check.bats
            echo "::endgroup::"
#+end_src
** ../.github/.trigger_on_push :code:
:PROPERTIES:
:CUSTOM_ID: ----github--trigger-on-push
:END:
#+begin_src sh :shebang ""
  Trigger: 3
#+end_src
** ../.gitignore :code:
:PROPERTIES:
:CUSTOM_ID: ----gitignore
:END:
#+begin_src sh :shebang ""
  .fslckout
  .projectile
  .fossil-settings/*
#+end_src
** Dockerfile :code:
:PROPERTIES:
:CUSTOM_ID: dockerfile
:END:
#+begin_src sh :shebang ""
  # * Arguments
  ARG \
      NS_MODULES_VERSION="${NS_MODULES_VERSION}" \
      NS_VERSION="${NS_VERSION}" \
      RL_JSON_VERSION="${RL_JSON_VERSION}" \
      TCLLIB_VERSION="${TCLLIB_VERSION}" \
      TCL_BUILD_IMAGE_NAME="${TCL_BUILD_IMAGE_NAME}" \
      TCL_BUILD_IMAGE_REPOSITORY="${TCL_BUILD_IMAGE_REPOSITORY}" \
      TCL_BUILD_IMAGE_TAG="${TCL_BUILD_IMAGE_TAG}" \
      TCL_VERSION="${TCL_VERSION}" \
      TDOM_VERSION="${TDOM_VERSION}" \
      THREAD_VERSION="${THREAD_VERSION}" \
      UBUNTU_IMAGE_NAME="${UBUNTU_IMAGE_NAME}" \
      UBUNTU_IMAGE_TAG="${UBUNTU_IMAGE_TAG}" \
      UBUNTU_IMAGE_REPOSITORY="${UBUNTU_IMAGE_REPOSITORY}" \
      XOTCL_VERSION="${XOTCL_VERSION}"

  # * Build software
  FROM ${TCL_BUILD_IMAGE_REPOSITORY}/${TCL_BUILD_IMAGE_NAME}:${TCL_BUILD_IMAGE_TAG} as build

  # ** Environmen
  ENV NS_VERSION="${NS_VERSION}" \
      NS_MODULES_VERSION="${NS_MODULES_VERSION}" \
      RL_JSON_VERSION_VERSION="${RL_JSON_VERSION_VERSION}" \
      TCLLIB_VERSION="${TCLLIB_VERSION}" \
      TCL_VERSION="${TCL_VERSION}" \
      TDOM_VERSION="${TDOM_VERSION}" \
      THREAD_VERSION="${THREAD_VERSION}" \
      XOTCL_VERSION="${XOTCL_VERSION}"

  # ** Build
  WORKDIR /
  RUN mkdir /workspaces
  COPY builds /builds
  RUN  /bin/bash /builds/all-build.sh

  # * From
  FROM ${UBUNTU_IMAGE_NAME}:${UBUNTU_IMAGE_TAG}

  # ** Copy Naviserver
  WORKDIR /
  COPY --from=build /usr/local/ns /usr/local/ns/

  # ** Labels
  # hadolint ignore=DL3048
  LABEL \
      maintainer="Oupfiz V <oupfiz5@yandex.ru>" \
      org.opencontainers.image.created="${BUILD_DATE}" \
      org.opencontainers.image.authors="Oupfiz V (Five)" \
      org.opencontainers.image.url="https://chiselapp.com/user/oupfiz5/repository/naviserver/home" \
      org.opencontainers.image.documentation="https://chiselapp.com/user/oupfiz5/repository/naviserver/wiki" \
      org.opencontainers.image.source="https://chiselapp.com/user/oupfiz5/repository/naviserver/brlist" \
      org.opencontainers.image.version="0.0.1d" \
      org.opencontainers.image.revision="" \
      org.opencontainers.image.vendor="" \
      org.opencontainers.image.licenses="" \
      org.opencontainers.image.ref.name="" \
      org.opencontainers.image.title="NaviServer on ubuntu base docker image" \
      org.opencontainers.image.description="NaviServer on ubuntu base docker image" \
      custom.package.version.naviserver="${NS_VERSION}" \
      custom.package.version.naviserver_modules="${NS_MODULES_VERSION}" \
      custom.package.version.rl_json_version="${RL_JSON_VERSION}" \
      custom.package.version.tcl="${TCL_VERSION}" \
      custom.package.version.tcllib="${TCLLIB_VERSION}" \
      custom.package.version.tdom="${TDOM_VERSION}" \
      custom.package.version.thread="${THREAD_VERSION}" \
      custom.package.version.xotcl="${XOTCL_VERSION}"

  # ** Run
  # hadolint ignore=DL3008
  RUN export LANG="en_US.UTF-8" \
      && export LC_ALL="en_US.UTF-8" \
      && apt-get update \
      && export DEBIAN_FRONTEND=noninteractive \
      && apt-get -y --no-install-recommends install libssl-dev locales libpq-dev postgresql-client wget \
      && locale-gen en_US.UTF-8 \
      && update-locale LANG="en_US.UTF-8" \
      && update-locale LC_ALL="en_US.UTF-8" \
      && apt-get clean \
      && apt-get auto-remove -y \
      && rm -rf /tmp/* /var/lib/apt/lists/* /var/cache/apt/* \
      && groupadd nsadmin \
      && useradd -g nsadmin nsadmin \
      && chown -R  nsadmin:nsadmin /usr/local/ns

  # ** Copy naviserver configurations
  COPY rootfs/usr/local/ns/conf /usr/local/ns/conf

  # ** Expose
  EXPOSE 8080

  # ** Environment
  Env NS_CONF="/usr/local/ns/conf/nsd-config.tcl"

  # ** Workdir
  WORKDIR /usr/local/ns

  # ** Entrypoint
  ENTRYPOINT ["/usr/local/ns/bin/nsd"]

  # ** Cmd
  CMD [ "-f", "-u","nsadmin","-g","nsadmin","-t", "/usr/local/ns/conf/nsd-config.tcl"]
#+end_src
** hook/build.sh :code:
:PROPERTIES:
:CUSTOM_ID: hook-build-sh
:END:
#+begin_src sh
    # shellcheck disable=SC1091
    set -a; source ../VERSIONS ; set +a;
    source ../builds/env-vars.sh

    IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
    DOCKERFILE="${DOCKERFILE:-Dockerfile}"

    docker build --no-cache \
           --build-arg UBUNTU_IMAGE_REPOSITORY="${UBUNTU_IMAGE_REPOSITORY}" \
           --build-arg UBUNTU_IMAGE_NAME="${UBUNTU_IMAGE_NAME}" \
           --build-arg UBUNTU_IMAGE_TAG="${UBUNTU_IMAGE_TAG}" \
           --build-arg TCL_BUILD_IMAGE_REPOSITORY="${TCL_BUILD_IMAGE_REPOSITORY}" \
           --build-arg TCL_BUILD_IMAGE_NAME="${TCL_BUILD_IMAGE_NAME}" \
           --build-arg TCL_BUILD_IMAGE_TAG="${TCL_BUILD_IMAGE_TAG}" \
           --build-arg BUILD_DATE="$(date -u +"%Y-%m-%dT%H:%M:%SZ")" \
           --build-arg VERSION="${NS_IMAGE_TAG}" \
           --build-arg NS_VERSION="${NS_VERSION}" \
           --build-arg NS_MODULES_VERSION="${NS_MODULES_VERSION}" \
           --build-arg RL_JSON_VERSION="${RL_JSON_VERSION}" \
           --build-arg TCLLIB_VERSION="${TCLLIB_VERSION}" \
           --build-arg TCL_VERSION="${TCL_VERSION}" \
           --build-arg TDOM_VERSION="${TDOM_VERSION}" \
           --build-arg THREAD_VERSION="${THREAD_VERSION}" \
           --build-arg XOTCL_VERSION="${XOTCL_VERSION}" \
           -t "${IMAGE}" \
           -f ../"${DOCKERFILE}" \
           ../.
#+end_src
** hook/push.sh :code:
:PROPERTIES:
:CUSTOM_ID: hook-push-sh
:END:
#+begin_src sh :results output pp :noweb strip-export :dir ../src/hook
  # shellcheck disable=SC1091
  set -a; source ../VERSIONS ; set +a;

  IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"

  docker push "${IMAGE}"
#+end_src

