Readme.md


<a id="configuration-file"></a>

## Configuration file

The default configuration file is `rootfs/usr/local/ns/conf/nsd-config.tcl`.  For using own configuration file you can apply docker mount option:

1.  Create own configuration file with name `nsd-config.tcl`
2.  Put it to some directory (for example `rootfs/usr/local/ns/conf/test`)
3.  Mount the the directory from item 2 as `/usr/local/ns/conf`

        docker run -itd \
               --restart always \
               --name=naviserver  \
               -p 127.0.0.1:8090:8080 \
               --mount type=bind,src=$(pwd)/rootfs/usr/local/ns/conf/test,destination=/usr/local/ns/conf \
               oupfiz5/naviserver:4.99.23


<a id="quickstart"></a>

# Quickstart

Start Naviserver using CLI:

    docker run -itd \
           --restart always \
           --name=naviserver \
           -p 127.0.0.1:8090:8080 \
           oupfiz5/naviserver:4.99.23

Start Naviserver using script `start.sh`:

    ./start.sh

After start open the naviserver will be accessible by url `http://localhost:8090`


<a id="continues-integration"></a>

# Continues integration

For  build and push docker images using  [Github Actions workflow](https://github.com/oupfiz5/naviserver/blob/master/.github/workflows/on-push.yaml). Flow process is [GitHub flow](https://guides.github.com/introduction/flow/).


<a id="troubleshooting"></a>

# Troubleshooting


<a id="log-output"></a>

## Log output

For debugging and maintenance purposes you may want access the output log. If you are using Docker version 1.3.0 or higher you can access a running containers shell by starting bash using docker interactive:

    docker run -it --rm \
           --name=naviserver \
           -p 127.0.0.1:8090:8080 \
           oupfiz5/naviserver:latest


<a id="shell-access"></a>

## Shell access

For debugging and maintenance purposes you may want access the containers shell. If you are using Docker version 1.3.0 or higher you can access a running containers shell by starting bash using docker exec:

    docker exec -it naviserver /bin/bash
